app/controllers/message_controller.rb

SELECT  "messages".* FROM "messages"  ORDER BY "messages"."id" DESC LIMIT 1
---
def show
	@message = Message.last

INSERT INTO "messages" ("Title", "Text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Title", "dsds"], ["Text", "sdfdsd"], ["created_at", "2015-04-02 16:29:43.287413"], ["updated_at", "2015-04-02 16:29:43.287413"]]
---
def create
	@message = Message.new(Title: params[:Title], Text: params[:Text])
	@message.save!

SELECT "users".* FROM "users"
---
def filter

   @search = User.search(params[:q])