app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
def profile
  @user=User.find(params[:id])

SELECT "users".* FROM "users"
---
def filter

   @search = User.search(params[:q])

SELECT  "users".* FROM "users"  ORDER BY created_at DESC LIMIT 1
---
def showuploads
    @users=User.recent
    @lastuser=User.order("created_at").last

SELECT  "users".* FROM "users" WHERE "users"."Email_Address" = ? LIMIT 1  [["Email_Address", "boo"]]
UPDATE "users" SET "Password" = ?, "GCM_RegID" = ?, "hashed_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["Password", "hello"], ["GCM_RegID", "5"], ["hashed_password", "0bdadbeb600f5fc37eac44926a6c992d74f9ad28"], ["updated_at", "2015-04-03 15:14:06.608709"], ["id", 4]]
---
  def register
      @user = User.find_by_Email_Address(params[:Email_Address].downcase)
      @user.Password = params[:Password]
      @user.GCM_RegID = params[:Reg_ID]
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."Email_Address" = ? LIMIT 1  [["Email_Address", "abc"]]
---
    def signin
      user = User.find_by_Email_Address(params[:Email_Address].downcase)

SELECT  "users".* FROM "users" WHERE "users"."confirm_token" = ? LIMIT 1  [["confirm_token", "HW2rrOFoQTiXr931kLgRTg"]]
---
    def confirm_email
      user = User.find_by_confirm_token(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."Email_Address" = ? LIMIT 1  [["Email_Address", "abc"]]
UPDATE "users" SET "confirm_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["confirm_token", "oOm1wmQsORodv4c8c-NcOw"], ["updated_at", "2015-04-03 15:17:25.105315"], ["id", 4]]
---
  def forgot_password
  user = User.find_by_Email_Address(params[:Email_Address].downcase)
  user.confirm_token = SecureRandom.urlsafe_base64.to_s
  user.save

SELECT  "users".* FROM "users" WHERE "users"."confirm_token" = ? LIMIT 1  [["confirm_token", "oOm1wmQsORodv4c8c-NcOw"]]
---
  def verify_link
    user = User.find_by_confirm_token(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."Email_Address" = ? LIMIT 1  [["Email_Address", "abc"]]
---
  def reset_password
    user = User.find_by_Email_Address(session[:Email_Address])